Revit 2027 API
CurveLoop.NumberOfCurves Method
 Returns the number of curves in the curve loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfCurves()
Public Function NumberOfCurves As Integer
public:
int NumberOfCurves()
member NumberOfCurves : unit -> int
Return Value
Int32
 The number of curves in the curve loop.
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace